codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mz1024eff064.h
#define _SPI4CON_FRMSYNC_POSITION                0x0000001E
#define _SPI4CON_FRMSYNC_MASK                    0x40000000
#define _SPI4CON_FRMSYNC_LENGTH                  0x00000001

#define _SPI4CON_FRMEN_POSITION                  0x0000001F
#define _SPI4CON_FRMEN_MASK                      0x80000000
#define _SPI4CON_FRMEN_LENGTH                    0x00000001

#define _SPI4CON_w_POSITION                      0x00000000
#define _SPI4CON_w_MASK                          0xFFFFFFFF
#define _SPI4CON_w_LENGTH                        0x00000020

#define _SPI4STAT_SPIRBF_POSITION                0x00000000
#define _SPI4STAT_SPIRBF_MASK                    0x00000001
#define _SPI4STAT_SPIRBF_LENGTH                  0x00000001

#define _SPI4STAT_SPITBF_POSITION                0x00000001
#define _SPI4STAT_SPITBF_MASK                    0x00000002
#define _SPI4STAT_SPITBF_LENGTH                  0x00000001

#define _SPI4STAT_SPITBE_POSITION                0x00000003
#define _SPI4STAT_SPITBE_MASK                    0x00000008
#define _SPI4STAT_SPITBE_LENGTH                  0x00000001

#define _SPI4STAT_SPIRBE_POSITION                0x00000005
#define _SPI4STAT_SPIRBE_MASK                    0x00000020
#define _SPI4STAT_SPIRBE_LENGTH                  0x00000001

#define _SPI4STAT_SPIROV_POSITION                0x00000006
#define _SPI4STAT_SPIROV_MASK                    0x00000040
#define _SPI4STAT_SPIROV_LENGTH                  0x00000001

#define _SPI4STAT_SRMT_POSITION                  0x00000007
#define _SPI4STAT_SRMT_MASK                      0x00000080
#define _SPI4STAT_SRMT_LENGTH                    0x00000001

#define _SPI4STAT_SPITUR_POSITION                0x00000008
#define _SPI4STAT_SPITUR_MASK                    0x00000100
#define _SPI4STAT_SPITUR_LENGTH                  0x00000001

#define _SPI4STAT_SPIBUSY_POSITION               0x0000000B
#define _SPI4STAT_SPIBUSY_MASK                   0x00000800
#define _SPI4STAT_SPIBUSY_LENGTH                 0x00000001

#define _SPI4STAT_FRMERR_POSITION                0x0000000C
#define _SPI4STAT_FRMERR_MASK                    0x00001000
#define _SPI4STAT_FRMERR_LENGTH                  0x00000001

#define _SPI4STAT_TXBUFELM_POSITION              0x00000010
#define _SPI4STAT_TXBUFELM_MASK                  0x001F0000
#define _SPI4STAT_TXBUFELM_LENGTH                0x00000005

#define _SPI4STAT_RXBUFELM_POSITION              0x00000018
#define _SPI4STAT_RXBUFELM_MASK                  0x1F000000
#define _SPI4STAT_RXBUFELM_LENGTH                0x00000005

#define _SPI4STAT_w_POSITION                     0x00000000
#define _SPI4STAT_w_MASK                         0xFFFFFFFF
#define _SPI4STAT_w_LENGTH                       0x00000020

#define _SPI4CON2_AUDMOD_POSITION                0x00000000
#define _SPI4CON2_AUDMOD_MASK                    0x00000003
#define _SPI4CON2_AUDMOD_LENGTH                  0x00000002

#define _SPI4CON2_AUDMONO_POSITION               0x00000003
#define _SPI4CON2_AUDMONO_MASK                   0x00000008
#define _SPI4CON2_AUDMONO_LENGTH                 0x00000001

#define _SPI4CON2_AUDEN_POSITION                 0x00000007
#define _SPI4CON2_AUDEN_MASK                     0x00000080
#define _SPI4CON2_AUDEN_LENGTH                   0x00000001

#define _SPI4CON2_IGNTUR_POSITION                0x00000008
#define _SPI4CON2_IGNTUR_MASK                    0x00000100
#define _SPI4CON2_IGNTUR_LENGTH                  0x00000001

#define _SPI4CON2_IGNROV_POSITION                0x00000009
#define _SPI4CON2_IGNROV_MASK                    0x00000200
#define _SPI4CON2_IGNROV_LENGTH                  0x00000001

#define _SPI4CON2_SPITUREN_POSITION              0x0000000A
#define _SPI4CON2_SPITUREN_MASK                  0x00000400
#define _SPI4CON2_SPITUREN_LENGTH                0x00000001

#define _SPI4CON2_SPIROVEN_POSITION              0x0000000B
#define _SPI4CON2_SPIROVEN_MASK                  0x00000800
#define _SPI4CON2_SPIROVEN_LENGTH                0x00000001

#define _SPI4CON2_FRMERREN_POSITION              0x0000000C
#define _SPI4CON2_FRMERREN_MASK                  0x00001000
#define _SPI4CON2_FRMERREN_LENGTH                0x00000001

#define _SPI4CON2_SPISGNEXT_POSITION             0x0000000F
#define _SPI4CON2_SPISGNEXT_MASK                 0x00008000
#define _SPI4CON2_SPISGNEXT_LENGTH               0x00000001

#define _SPI4CON2_AUDMOD0_POSITION               0x00000000
#define _SPI4CON2_AUDMOD0_MASK                   0x00000001
#define _SPI4CON2_AUDMOD0_LENGTH                 0x00000001

#define _SPI4CON2_AUDMOD1_POSITION               0x00000001
#define _SPI4CON2_AUDMOD1_MASK                   0x00000002
#define _SPI4CON2_AUDMOD1_LENGTH                 0x00000001

#define _SPI4CON2_w_POSITION                     0x00000000
#define _SPI4CON2_w_MASK                         0xFFFFFFFF
#define _SPI4CON2_w_LENGTH                       0x00000020

#define _U1MODE_STSEL_POSITION                   0x00000000
#define _U1MODE_STSEL_MASK                       0x00000001
#define _U1MODE_STSEL_LENGTH                     0x00000001

#define _U1MODE_PDSEL_POSITION                   0x00000001
#define _U1MODE_PDSEL_MASK                       0x00000006
#define _U1MODE_PDSEL_LENGTH                     0x00000002

#define _U1MODE_BRGH_POSITION                    0x00000003
#define _U1MODE_BRGH_MASK                        0x00000008
#define _U1MODE_BRGH_LENGTH                      0x00000001

#define _U1MODE_RXINV_POSITION                   0x00000004
#define _U1MODE_RXINV_MASK                       0x00000010
#define _U1MODE_RXINV_LENGTH                     0x00000001

#define _U1MODE_ABAUD_POSITION                   0x00000005
#define _U1MODE_ABAUD_MASK                       0x00000020
#define _U1MODE_ABAUD_LENGTH                     0x00000001

#define _U1MODE_LPBACK_POSITION                  0x00000006
#define _U1MODE_LPBACK_MASK                      0x00000040
#define _U1MODE_LPBACK_LENGTH                    0x00000001

#define _U1MODE_WAKE_POSITION                    0x00000007
#define _U1MODE_WAKE_MASK                        0x00000080
#define _U1MODE_WAKE_LENGTH                      0x00000001

#define _U1MODE_UEN_POSITION                     0x00000008
#define _U1MODE_UEN_MASK                         0x00000300
#define _U1MODE_UEN_LENGTH                       0x00000002

